


Network Working Group                                     V. Devarapalli
Internet-Draft                                                  WiChorus
Intended status: Standards Track                              K. Weniger
Expires: September 24, 2009                               March 23, 2009


                      Redirect Mechanism for IKEv2
                draft-ietf-ipsecme-ikev2-redirect-06.txt

Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.  This document may not be modified,
   and derivative works of it may not be created, except to format it
   for publication as an RFC or to translate it into languages other
   than English.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on September 24, 2009.

Copyright Notice

   Copyright (c) 2009 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents in effect on the date of
   publication of this document (http://trustee.ietf.org/license-info).
   Please review these documents carefully, as they describe your rights
   and restrictions with respect to this document.






Devarapalli & Weniger  Expires September 24, 2009               [Page 1]

Internet-Draft               IKEv2 Redirect                   March 2009


Abstract

   IKEv2 is a protocol for setting up VPN tunnels from a remote location
   to a gateway so that the VPN client can access services in the
   network behind the gateway.  Currently there is no standard mechanism
   specified that allows an overloaded VPN gateway or a VPN gateway that
   is being shut down for maintenance to redirect the VPN client to
   attach to another gateway.  This document proposes a redirect
   mechanism for IKEv2.  The proposed mechanism can also be used in
   Mobile IPv6 to enable the home agent to redirect the mobile node to
   another home agent.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  4
   3.  IKEv2 Exchange with Redirect . . . . . . . . . . . . . . . . .  4
   4.  Use of Anycast Addresses with the Redirect Mechanism . . . . .  5
   5.  Gateway Initiated Redirect . . . . . . . . . . . . . . . . . .  6
   6.  Redirect Messages  . . . . . . . . . . . . . . . . . . . . . .  7
     6.1.  REDIRECT_SUPPORTED . . . . . . . . . . . . . . . . . . . .  8
     6.2.  REDIRECT . . . . . . . . . . . . . . . . . . . . . . . . .  8
     6.3.  REDIRECTED_FROM  . . . . . . . . . . . . . . . . . . . . .  9
   7.  Use of the Redirect Mechanism between IKEv2 Peers  . . . . . . 10
   8.  Security Considerations  . . . . . . . . . . . . . . . . . . . 10
   9.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 11
   10. Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 11
   11. References . . . . . . . . . . . . . . . . . . . . . . . . . . 12
     11.1. Normative References . . . . . . . . . . . . . . . . . . . 12
     11.2. Informative References . . . . . . . . . . . . . . . . . . 12
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 12



















Devarapalli & Weniger  Expires September 24, 2009               [Page 2]

Internet-Draft               IKEv2 Redirect                   March 2009


1.  Introduction

   IKEv2 [2] is used for setting up IPsec-based VPNs.  The IP address of
   the VPN gateway can be configured on the VPN client.  But this does
   not scale well, when the number of VPN gateways is large.  Dynamic
   discovery of VPN gateways using DNS is quite widely used too.
   However, using DNS is not flexible when it comes to assigning a VPN
   gateway to the VPN client based on the load on the VPN gateways.  The
   VPN client typically tries to connect to the IP address of the VPN
   gateways that appears first in the DNS response.  If the VPN tunnel
   setup fails, then the VPN client tries to attach to the other VPN
   gateways returned in the DNS response.

   This document proposes a redirect mechanism for IKEv2 that enables a
   VPN gateway to redirect the VPN client to another VPN gateway, for
   example, based on the load condition.  The redirect can be done
   during during the IKE_SA_INIT or the IKE_AUTH exchange.  Gateway-
   initiated redirect in the middle of a session is also supported.  The
   redirect mechanism can also be used in conjunction with anycast
   addresses.  In this case, anycast address for the cluster of VPN
   gateways is stored in the DNS instead of a list of unicast IP
   addresses of the VPN gateways.

   The redirect can also happen because of administrative or optimal
   routing reasons.  This document does not attempt to provide an
   exhaustive list of reasons for redirecting a VPN client to another
   VPN gateway.

   Mobile IPv6 [3] may use IKEv2 for mutual authentication between the
   mobile node and the home agent.  IKEv2 may also be used for home
   address configuration and setting up IPsec security associations for
   protecting Mobile IPv6 signaling messages [4].  The IKEv2 exchange
   precedes the exchange of Mobile IPv6 signaling messages.  Therefore
   the mechanism described in this document can be also be used by a
   Mobile IPv6 home agent to redirect a mobile node to another home
   agent.

   There is a Home Agent Switch mechanism available for redirecting a
   mobile node to another home agent, described in [5].  The Home Agent
   Switch mechanism can only be used after the binding cache had been
   created at the home agent for the mobile node.  The disadvantage with
   this is that quite a bit of state is created on the home agent before
   the mobile node can be redirected to another home agent.  The
   mechanism described in this document can be used for redirecting a
   mobile node before any state related to the Mobile IPv6 binding is
   created on the home agent.





Devarapalli & Weniger  Expires September 24, 2009               [Page 3]

Internet-Draft               IKEv2 Redirect                   March 2009


2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [1].


3.  IKEv2 Exchange with Redirect

   To redirect an IKEv2 session to another VPN gateway, the VPN gateway
   that initially received the IKE_SA_INIT request selects another VPN
   gateway and responds to the VPN client with a REDIRECT Notification
   payload.  The mechanism by which the initial VPN gateway selects
   another VPN gateway is out of scope for this document.  The IP
   address of the selected VPN gateway is sent in the REDIRECT payload.
   The gateway MUST include the nonce data from the Ni payload sent by
   the initiator in the REDIRECT payload.  This prevents certain Denial-
   of-Service attacks on the initiator that could be caused by an
   attacker injecting IKE_SA_INIT responses with REDIRECT payloads.

   The VPN client indicates support for the IKEv2 redirect mechanism by
   including a REDIRECT_SUPPORTED notification message in the initial
   IKE_SA_INIT request.  If the IKE_SA_INIT request did not include the
   REDIRECT_SUPPORTED payload, the responder MUST NOT send the REDIRECT
   payload to the VPN client.

       Initiator                    Responder (initial VPN GW)
       ---------                    -------------------------

    (IP_I:500 -> Initial_IP_R:500)
    HDR(A,0), SAi1, KEi, Ni,   -->
    N(REDIRECT_SUPPORTED)

                              (Initial_IP_R:500 -> IP_I:500)
                          <-- HDR(A,0), N(REDIRECT, IP_R)


   When the VPN client receives the IKE_SA_INIT response with the
   REDIRECT payload, it initiates a new IKE_SA_INIT exchange with the
   VPN gateway listed in the REDIRECT payload.  The VPN client includes
   the IP address of the original VPN gateway that redirected the
   client.  The IKEv2 exchange then proceeds as normal with the selected
   VPN gateway.








Devarapalli & Weniger  Expires September 24, 2009               [Page 4]

Internet-Draft               IKEv2 Redirect                   March 2009


       Initiator                   Responder (Selected VPN GW)
       ---------                   ---------------------------

    (IP_I:500 -> IP_R:500)
    HDR(A,0), SAi1, KEi, Ni,   -->
    N(REDIRECTED_FROM, Initial_IP_R)

                              (IP_R:500 -> IP_I:500)
                          <-- HDR(A,B), SAr1, KEr, Nr,[CERTREQ]

    (IP_I:500 -> IP_R:500)
    HDR(A,B), SK {IDi, [CERT,] [CERTREQ,]
    [IDr,]AUTH, SAi2, TSi, TSr} -->

                              (IP_R:500 -> IP_I:500)
                          <-- HDR(A,B), SK {IDr, [CERT,] AUTH,
                                                 SAr2, TSi, TSr}

   When this mechanism is used with Mobile IPv6, a mobile node's
   security associations with its home agent may expire while it still
   has a valid binding cache entry at the home agent.  In this case, the
   mobile node MUST NOT use the original home agent address as the
   destination address in the IKE_SA_INIT exchange to setup new security
   associations.  It MUST try to setup security associations with its
   existing home agent.


4.  Use of Anycast Addresses with the Redirect Mechanism

   The use of anycast addresses will avoid having to configure a
   particular VPN gateway's IP address in the DNS.  Instead, the anycast
   address that represents the group of VPN gateways is stored in the
   DNS.  When the VPN client performs a DNS lookup for the VPN gateway,
   it receives the anycast address of the VPN gateway in the DNS
   response.

   If an anycast address is returned in response to DNS resolution of an
   FQDN, the VPN client sends the IKE_SA_INIT request to the anycast
   address.  The IKE_SA_INIT request is routed to one of the VPN
   gateways that is part of the anycast group.  The VPN gateway that
   receives the IKE_SA_INIT request responds with an IKE_SA_INIT reply
   from the anycast address.









Devarapalli & Weniger  Expires September 24, 2009               [Page 5]

Internet-Draft               IKEv2 Redirect                   March 2009


       Initiator                    Responder (any VPN GW)
       ---------                    -------------------------

    (IP_I:500 -> ANYCAST:500)
    HDR(A,0), SAi1, KEi, Ni)   -->
    N(REDIRECT_SUPPORTED)

                              (ANYCAST:500 -> IP_I:500)
                          <-- HDR(A,0), N(REDIRECT, IP_R)

   If the destination address on the IKE_SA_INIT request is an anycast
   address, the VPN gateway that received the IKE_SA_INIT request MUST
   include the REDIRECT payload to redirect the VPN client to a unicast
   address of one of the VPN gateway.  The VPN gateway that received the
   IKE_SA_INIT request MAY redirect the client to its own unicast
   address, if it is not overloaded.

   The rest of the IKEv2 exchange is the same as described in Section 3.


5.  Gateway Initiated Redirect

   The redirect mechanism may also be used by a VPN gateway to redirect
   the client to another VPN gateway in middle of a session.  To
   redirect a client, the gateway should send an INFORMATIONAL message
   with the REDIRECT Notify payload.  The REDIRECT payload MUST carry
   information about the new VPN gateway.  The gateway MUST NOT include
   any nonce data in the REDIRECT payload, since it is a gateway-
   initiated message and is protected by the IKEv2 security association.
   When the client receives this message, it MUST send an empty message
   as an acknowledgement.  Until the client responds with an
   acknowledgement, the gateway SHOULD re-transmit the redirect
   INFORMATIONAL message as described in [2].  The following illustrates
   the INFORMATIONAL message exchange for gateway-initiated redirect.

       Initiator (VPN client)        Responder (VPN GW)
       ----------------------        ------------------

                               <--  HDR, SK {N[REDIRECT, IP_R/FQDN_R]}

     HDR, SK {} -->

   The INFORMATIONAL message exchange described above is protected by
   the existing IKEv2 SA between the client and the gateway.

   Once the client sends an acknowledgement to the gateway, it SHOULD
   delete the existing security associations with the old gateway by
   sending an Informational message with a DELETE payload.  The gateway



Devarapalli & Weniger  Expires September 24, 2009               [Page 6]

Internet-Draft               IKEv2 Redirect                   March 2009


   MAY also decide to delete the security associations without any
   signaling from the client, again by sending an Informational message
   with a DELETE payload.  However, it should allow sufficient time for
   the client to setup the required security associations with the new
   security gateway.  This time period should be configurable on the
   gateway.

   If the gateway decides to redirect the client during the IKE_AUTH
   exchange, based on the identity presented by the client in the
   IKE_AUTH request message, it prevents the creation of a CHILD SA and
   sends the REDIRECT payload in the IKE_AUTH response.  When the client
   receives the IKE_AUTH response with the REDIRECT payload, it SHOULD
   delete the existing IKEv2 security association with the gateway.

        Initiator                    Responder ( VPN GW)
        ---------                    -------------------

    (IP_I:500 -> IP_R:500)
    HDR(A,0), SAi1, KEi, Ni,   -->
    N(REDIRECTED_SUPPORTED)

                                  (IP_R:500 -> IP_I:500)
                              <-- HDR(A,B), SAr1, KEr, Nr,[CERTREQ]

    (IP_I:500 -> IP_R:500)
    HDR(A,B), SK {IDi, [CERT,] [CERTREQ,]
    [IDr,]AUTH, SAi2, TSi, TSr} -->

                                  (IP_R:500 -> IP_I:500)
                              <-- HDR(A,B), SK {IDr, [CERT,] AUTH,
                                           N[REDIRECT, IP_R/FQDN_R]}

   In case the IKE_AUTH exchange involves EAP authentication as
   described in Section 2.16 of RFC 4306 [2] or multiple authentication
   methods as described in RFC 4739 [6], the IKE_AUTH exchange is more
   complicated.  The identity presented by the client in the first
   IKE_AUTH request might be a temporary one.  In addition, the gateway
   might decide to redirect the client based on the interaction with the
   the AAA server, when EAP authentication is used or the external
   authentication server, when multiple authentication methods are used.
   In such cases, the exact message in which the gateway sends the
   REDIRECT payload is TBD.


6.  Redirect Messages






Devarapalli & Weniger  Expires September 24, 2009               [Page 7]

Internet-Draft               IKEv2 Redirect                   March 2009


6.1.  REDIRECT_SUPPORTED

   The REDIRECT_SUPPORTED payload is included in the initial IKE_SA_INIT
   request by the initiator to indicate support for the IKEv2 redirect
   mechanism described in this document.

                        1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    | Next Payload  |C|  RESERVED   |         Payload Length        |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |  Protocol ID  | SPI Size (=0) |      Notify Message Type      |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The 'Next Payload', 'Payload Length', 'Protocol ID', 'SPI Size' and
   the 'Notify Message Type' fields are the same as described in Section
   3.10 of [2].  The 'SPI Size' field MUST be set to 0 to indicate that
   the SPI is not present in this message.  The 'Protocol ID' MUST be
   set to 0, since the notification is not specific to a particular
   security association.

   The 'Payload Length' field MUST be set to '8'.  The 'Notify Message
   Type' field is set to indicate the REDIRECT_SUPPORTED payload <value
   to be assigned by IANA>.

6.2.  REDIRECT

   The REDIRECT payload is included in an IKE_SA_INIT response from the
   responder or an INFORMATIONAL message from the responder, when the
   responder wants to redirect the initiator to another VPN gateway.
   The message includes the new responder's IP address.

                        1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    | Next Payload  |C|  RESERVED   |         Payload Length        |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |  Protocol ID  | SPI Size (=0) |      Notify Message Type      |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    | GW Ident Type |                                               |
    +---------------+                                               ~
    ~                   New Responder GW Identity                   ~
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                                                               |
    ~                        Nonce Data                             ~
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



Devarapalli & Weniger  Expires September 24, 2009               [Page 8]

Internet-Draft               IKEv2 Redirect                   March 2009


   The 'Next Payload', 'Payload Length', 'Protocol ID', 'SPI Size' and
   the 'Notify Message Type' fields are the same as described in Section
   3.10 of [2].  The 'SPI Size' field MUST be set to 0 to indicate that
   the SPI is not present in this message.  The 'Protocol ID' MUST be
   set to 0, since the notification is not specific to a particular
   security association.

   If the IP address of the new VPN gateway is sent, the 'Payload
   Length' field MUST be set to either '13' or '25' depending on whether
   an IPv4 or IPv6 address is sent in the message.  If the FQDN of the
   new VPN gateway is sent, the 'Payload Length' field is set to the
   length of the FQDN plus the fixed fields in the message.  The 'Notify
   Message Type' field is set to indicate the REDIRECT payload <value to
   be assigned by IANA>.  The 'GW Identity Type' field indicates the
   type of information that is sent to identify the new VPN gateway.
   The following values are reserved by this document.

      1 - IPv4 address of the new VPN gateway
      2 - IPv6 address of the new VPN gateway
      3 - FQDN of the new VPN gateway

   All other values for this field are reserved and MUST NOT be used.
   The identity of the new VPN gateway is carried in the 'New Responder
   GW Identity' field.

   The 'Nonce Data' field carries the nonce data from the Ni payload
   sent by the initiator.  The size of the nonce MUST be between 16 and
   256 bytes as described in Section 3.9 of [2].  The 'Nonce Data' field
   is present in the REDIRECT payload only when the REDIRECT payload is
   sent in the IKE_SA_INIT response message.  It MUST NOT be included in
   the REDIRECT payload if sent in an IKE_AUTH response or in a gateway-
   initiated redirect message.

6.3.  REDIRECTED_FROM

   The REDIRECTED_FROM message type is included in the IKE_SA_INIT
   request from the initiator to the new VPN gateway to indicate the IP
   address of the original VPN gateway that redirected the initiator.
   The original VPN gateway's IP address is included in the message.












Devarapalli & Weniger  Expires September 24, 2009               [Page 9]

Internet-Draft               IKEv2 Redirect                   March 2009


                        1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    | Next Payload  |C|  RESERVED   |         Payload Length        |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |  Protocol ID  | SPI Size (=0) |      Notify Message Type      |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    | GW Ident Type |                                               |
    +---------------+                                               ~
    ~                   Original Responder GW Identity              ~
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The 'Next Payload', 'Payload Length', 'Protocol ID', 'SPI Size' and
   the 'Notify Message Type' fields are the same as described in Section
   3.10 of [2] The 'SPI Size' field MUST be set to 0 to indicate that
   the SPI is not present in this message.  The 'Protocol ID' MUST be
   set to 0, since the notification is not specific to a particular
   security association.

   The 'Payload Length' field MUST be set to either '13' or '25'
   depending on whether an IPv4 or IPv6 address of the original VPN
   gateway is sent in the message.  The 'Notify Message Type' field is
   set to indicate the REDIRECTED_FROM payload <value to be assigned by
   IANA>.  The 'GW Identity Type' field indicates the type of
   information that is sent to identify the new VPN gateway.  The
   following values are reserved by this document.

      1 - IPv4 address of the original VPN gateway
      2 - IPv6 address of the original VPN gateway

   All other values for this field are reserved and MUST NOT be used.
   The identity of the original VPN gateway is carried in the 'Original
   Responder GW Identity' field.


7.  Use of the Redirect Mechanism between IKEv2 Peers

   The Redirect mechanism described in this document is mainly intended
   for use in client-gateway scenarios.  However, the mechanism can also
   be used between any two IKEv2 peers.  But this protocol is
   asymmetric, meaning that only the original responder can redirect the
   original initiator to another server.


8.  Security Considerations

   An eavesdropper on the path between VPN client and server may send a



Devarapalli & Weniger  Expires September 24, 2009              [Page 10]

Internet-Draft               IKEv2 Redirect                   March 2009


   redirect to the client upon receiving an IKE_SA_INIT message from
   this client.  This is no problem regarding DoS attacks for the VPN
   connection, since an on-path-attacker can as well drop the
   IKE_SA_INIT requests to prevent VPN access for the client.  But an
   eavesdropper on the path between VPN client and server can redirect a
   large number of clients to a victim, which is then flooded with
   IKE_SA_INIT requests.  Flooding only happens if many clients initiate
   IKEv2 exchange at almost the same time, which is considered a rare
   event.  However, this may happen if a Home Agent/VPN server is
   shutdown for maintenance and all clients need to re-establish VPN
   connections with another Home Agent/VPN server or if the on-path
   attacker forces all IPsec security associations to expire by dropping
   all received IKEv2 messages.

   The use of REDIRECTED_FROM payload is intended to discourage a rogue
   VPN gateway from redirecting a large number of VPN clients to a
   particular VPN gateway.  It does not prevent such a DoS attack.


9.  IANA Considerations

   This document defines four new IKEv2 Notification Message types as
   described in Section 6.  The three Notify Message Types must be
   assigned values between 16396 and 40959.

   o  REDIRECT_SUPPORTED
   o  REDIRECT
   o  REDIRECTED_FROM


10.  Acknowledgements

   The use of anycast address with IKEv2 was first described in [7].  It
   was then added to an early draft version of RFC 5026 and later
   removed before the RFC was published.  Therefore the authors of [7]
   and RFC 5026 are acknowledged.

   Thanks to Pasi Eronen, with whom the solution described in this
   document was extensively discussed.  Thanks to Tero Kivinen for
   suggesting the use of REDIRECTED_FROM payload and other comments
   which helped improve the document.  The authors would also like to
   thank Yaron Sheffer, Sunil Kumar, Fan Zhao, Yoav Nir, Richard
   Graveman, and Arnaud Ebalard for their reviews and comments.


11.  References





Devarapalli & Weniger  Expires September 24, 2009              [Page 11]

Internet-Draft               IKEv2 Redirect                   March 2009


11.1.  Normative References

   [1]  Bradner, S., "Key words for use in RFCs to Indicate Requirement
        Levels", BCP 14, RFC 2119, March 1997.

   [2]  Kaufman, C., "Internet Key Exchange (IKEv2) Protocol", RFC 4306,
        December 2005.

11.2.  Informative References

   [3]  Johnson, D., Perkins, C., and J. Arkko, "Mobility Support in
        IPv6", RFC 3775, June 2004.

   [4]  Giaretta, G., Kempf, J., and V. Devarapalli, "Mobile IPv6
        Bootstrapping in Split Scenario", RFC 5026, October 2007.

   [5]  Haley, B., Devarapalli, V., Deng, H., and J. Kempf, "Mobility
        Header Home Agent Switch Message", RFC 5142, January 2008.

   [6]  Eronen, P. and J. Korhonen, "Multiple Authentication Exchanges
        in the Internet Key Exchange (IKEv2) Protocol", RFC 4739,
        November 2006.

   [7]  Weniger, K. and F. Dupont, "IKEv2-based Home Agent Assignment in
        Mobile IPv6/NEMO Bootstrapping", draft-dupont-ikev2-haassign-02
        (work in progress), January 2007.


Authors' Addresses

   Vijay Devarapalli
   WiChorus
   3590 North First St
   San Jose, CA  95134
   USA

   Email: vijay@wichorus.com


   Kilian Weniger

   Email: kilian.weniger@googlemail.com









Devarapalli & Weniger  Expires September 24, 2009              [Page 12]

